### 🌊 Neptune Apply Results

**Terraform Stacks:** `apps/web, apps/web/ci-109-1, apps/web/ci-109-2`

**Neptune completed the apply with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23625551056)

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 00:53:30.328 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98
00:53:30.702 INFO   tofu: Initializing the backend...
00:53:31.145 INFO   tofu: 
00:53:31.145 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:53:31.145 INFO   tofu: use this backend unless the backend configuration changes.
00:53:31.358 INFO   tofu: Initializing provider plugins...
00:53:31.358 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:53:31.527 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:53:31.919 INFO   tofu: - Installing hashicorp/null v3.2.4...
00:53:32.359 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:53:32.718 INFO   tofu: - Installing hashicorp/local v2.7.0...
00:53:33.179 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:53:33.179 INFO   tofu: Providers are signed by their developers.
00:53:33.179 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
00:53:33.179 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
00:53:33.179 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:53:33.179 INFO   tofu: selections it made above. Include this file in your version control repository
00:53:33.179 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
00:53:33.179 INFO   tofu: you run "tofu init" in the future.
00:53:33.179 INFO   tofu: OpenTofu has been successfully initialized!
00:53:33.179 INFO   tofu: 
00:53:33.179 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:53:33.179 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:53:33.179 INFO   tofu: should now work.
00:53:33.179 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:53:33.179 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
00:53:33.179 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web] 00:53:34.080 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
00:53:34.081 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
00:53:34.090 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:53:34.090 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:53:34.091 STDOUT tofu:   + create
00:53:34.091 STDOUT tofu: OpenTofu will perform the following actions:
00:53:34.091 STDOUT tofu:   # local_file.output will be created
00:53:34.091 STDOUT tofu:   + resource "local_file" "output" {
00:53:34.091 STDOUT tofu:       + content              = "apps/web deployed"
00:53:34.091 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:53:34.091 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:53:34.091 STDOUT tofu:       + content_md5          = (known after apply)
00:53:34.091 STDOUT tofu:       + content_sha1         = (known after apply)
00:53:34.091 STDOUT tofu:       + content_sha256       = (known after apply)
00:53:34.091 STDOUT tofu:       + content_sha512       = (known after apply)
00:53:34.091 STDOUT tofu:       + directory_permission = "0777"
00:53:34.091 STDOUT tofu:       + file_permission      = "0777"
00:53:34.091 STDOUT tofu:       + filename             = "./output.txt"
00:53:34.091 STDOUT tofu:       + id                   = (known after apply)
00:53:34.091 STDOUT tofu:     }
00:53:34.091 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
00:53:34.092 STDOUT tofu: 
00:53:34.130 STDOUT tofu: local_file.output: Creating...
00:53:34.132 STDOUT tofu: local_file.output: Creation complete after 0s [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
00:53:34.134 STDOUT tofu: 
00:53:34.134 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
00:53:34.134 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-109-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-109-1] 00:53:34.443 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/qLodFRy-Pd8flVuPqklwKNwL3-k/wXSEdkNd5e5MY27MFN0bjqcoO98
00:53:34.767 INFO   tofu: Initializing the backend...
00:53:35.158 INFO   tofu: 
00:53:35.158 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:53:35.158 INFO   tofu: use this backend unless the backend configuration changes.
00:53:35.276 INFO   tofu: Initializing provider plugins...
00:53:35.276 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:53:35.426 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:53:35.827 INFO   tofu: - Installing hashicorp/local v2.7.0...
00:53:36.322 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:53:36.675 INFO   tofu: - Installing hashicorp/null v3.2.4...
00:53:37.135 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:53:37.135 INFO   tofu: Providers are signed by their developers.
00:53:37.135 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
00:53:37.135 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
00:53:37.135 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:53:37.135 INFO   tofu: selections it made above. Include this file in your version control repository
00:53:37.135 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
00:53:37.135 INFO   tofu: you run "tofu init" in the future.
00:53:37.136 INFO   tofu: OpenTofu has been successfully initialized!
00:53:37.136 INFO   tofu: 
00:53:37.136 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:53:37.136 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:53:37.136 INFO   tofu: should now work.
00:53:37.136 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:53:37.136 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
00:53:37.136 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-109-1] 00:53:37.971 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:53:37.971 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:53:37.971 STDOUT tofu:   + create
00:53:37.971 STDOUT tofu: OpenTofu will perform the following actions:
00:53:37.972 STDOUT tofu:   # local_file.output will be created
00:53:37.972 STDOUT tofu:   + resource "local_file" "output" {
00:53:37.972 STDOUT tofu:       + content              = "apps/web/ci-109-1 deployed"
00:53:37.972 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:53:37.972 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:53:37.972 STDOUT tofu:       + content_md5          = (known after apply)
00:53:37.972 STDOUT tofu:       + content_sha1         = (known after apply)
00:53:37.972 STDOUT tofu:       + content_sha256       = (known after apply)
00:53:37.972 STDOUT tofu:       + content_sha512       = (known after apply)
00:53:37.972 STDOUT tofu:       + directory_permission = "0777"
00:53:37.972 STDOUT tofu:       + file_permission      = "0777"
00:53:37.973 STDOUT tofu:       + filename             = "./output.txt"
00:53:37.973 STDOUT tofu:       + id                   = (known after apply)
00:53:37.973 STDOUT tofu:     }
00:53:37.973 STDOUT tofu:   # null_resource.stack will be created
00:53:37.973 STDOUT tofu:   + resource "null_resource" "stack" {
00:53:37.973 STDOUT tofu:       + id       = (known after apply)
00:53:37.973 STDOUT tofu:       + triggers = {
00:53:37.973 STDOUT tofu:           + "stack" = "apps/web/ci-109-1"
00:53:37.973 STDOUT tofu:         }
00:53:37.973 STDOUT tofu:     }
00:53:37.973 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
00:53:37.973 STDOUT tofu: 
00:53:38.046 STDOUT tofu: null_resource.stack: Creating...
00:53:38.048 STDOUT tofu: null_resource.stack: Creation complete after 0s [id=7258362004955633520]
00:53:38.049 STDOUT tofu: local_file.output: Creating...
00:53:38.051 STDOUT tofu: local_file.output: Creation complete after 0s [id=716f277ece4e320f1d315b70c55f278142258368]
00:53:38.185 STDOUT tofu: 
00:53:38.185 STDOUT tofu: Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
00:53:38.185 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-109-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-109-2] 00:53:38.493 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/3YoUAMps4hZ-VebATIkp3_cAl6o/wXSEdkNd5e5MY27MFN0bjqcoO98
00:53:38.847 INFO   tofu: Initializing the backend...
00:53:39.215 INFO   tofu: 
00:53:39.215 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:53:39.215 INFO   tofu: use this backend unless the backend configuration changes.
00:53:39.337 INFO   tofu: Initializing provider plugins...
00:53:39.337 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
00:53:39.466 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
00:53:39.868 INFO   tofu: - Installing hashicorp/null v3.2.4...
00:53:40.309 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
00:53:40.663 INFO   tofu: - Installing hashicorp/local v2.7.0...
00:53:41.140 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
00:53:41.140 INFO   tofu: Providers are signed by their developers.
00:53:41.140 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
00:53:41.140 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
00:53:41.140 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:53:41.140 INFO   tofu: selections it made above. Include this file in your version control repository
00:53:41.140 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
00:53:41.140 INFO   tofu: you run "tofu init" in the future.
00:53:41.140 INFO   tofu: OpenTofu has been successfully initialized!
00:53:41.140 INFO   tofu: 
00:53:41.140 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:53:41.140 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:53:41.141 INFO   tofu: should now work.
00:53:41.141 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:53:41.141 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
00:53:41.141 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-109-2] 00:53:41.930 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:53:41.930 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:53:41.930 STDOUT tofu:   + create
00:53:41.930 STDOUT tofu: OpenTofu will perform the following actions:
00:53:41.931 STDOUT tofu:   # local_file.output will be created
00:53:41.931 STDOUT tofu:   + resource "local_file" "output" {
00:53:41.931 STDOUT tofu:       + content              = "apps/web/ci-109-2 deployed"
00:53:41.931 STDOUT tofu:       + content_base64sha256 = (known after apply)
00:53:41.931 STDOUT tofu:       + content_base64sha512 = (known after apply)
00:53:41.931 STDOUT tofu:       + content_md5          = (known after apply)
00:53:41.931 STDOUT tofu:       + content_sha1         = (known after apply)
00:53:41.931 STDOUT tofu:       + content_sha256       = (known after apply)
00:53:41.931 STDOUT tofu:       + content_sha512       = (known after apply)
00:53:41.932 STDOUT tofu:       + directory_permission = "0777"
00:53:41.932 STDOUT tofu:       + file_permission      = "0777"
00:53:41.932 STDOUT tofu:       + filename             = "./output.txt"
00:53:41.932 STDOUT tofu:       + id                   = (known after apply)
00:53:41.932 STDOUT tofu:     }
00:53:41.932 STDOUT tofu:   # null_resource.stack will be created
00:53:41.932 STDOUT tofu:   + resource "null_resource" "stack" {
00:53:41.932 STDOUT tofu:       + id       = (known after apply)
00:53:41.933 STDOUT tofu:       + triggers = {
00:53:41.933 STDOUT tofu:           + "stack" = "apps/web/ci-109-2"
00:53:41.933 STDOUT tofu:         }
00:53:41.933 STDOUT tofu:     }
00:53:41.933 STDOUT tofu: Plan: 2 to add, 0 to change, 0 to destroy.
00:53:41.933 STDOUT tofu: 
00:53:42.001 STDOUT tofu: null_resource.stack: Creating...
00:53:42.005 STDOUT tofu: null_resource.stack: Creation complete after 0s [id=2201881030147640587]
00:53:42.007 STDOUT tofu: local_file.output: Creating...
00:53:42.009 STDOUT tofu: local_file.output: Creation complete after 0s [id=7f2647cb63f6fb23e8fcb35bcfe7dc4a775fc13d]
00:53:42.143 STDOUT tofu: 
00:53:42.143 STDOUT tofu: Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
00:53:42.143 STDOUT tofu: 
```

</details>



Automatically merging because all changed stacks have been successfully applied.
